openfoam/cfd_v2_mesh_independence/cases/medium/constant/momentumTransport
FoamFile { format ascii; class dictionary; object momentumTransport; }

simulationType RAS;
RAS
{
    model       kOmegaSST;
    turbulence  on;
}

