openfoam/cfd_v2_mesh_independence/cases/medium/system/decomposeParDict
FoamFile { format ascii; class dictionary; object decomposeParDict; }

numberOfSubdomains 10;
method scotch;

