openfoam/cfd_v2_mesh_independence/cases/medium/system/surfaceFeaturesDict
FoamFile { format ascii; class dictionary; object surfaceFeaturesDict; }

surfaces ("CargoUAV_cruise_m.stl");
includedAngle 150;
subsetFeatures
{
    nonManifoldEdges no;
    openEdges yes;
}

